elua/elua/src/platform/xmc4000/xmclib/inc/xmc_usic.h
/**
 * @file xmc_usic.h
 * @date 2016-04-10
 *
 * @cond
  *********************************************************************************************************************
 * XMClib v2.1.6 - XMC Peripheral Driver Library 
 *
 * Copyright (c) 2015-2016, Infineon Technologies AG
 * All rights reserved.                        
 *                                             
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the 
 * following conditions are met:   
 *                                                                              
 * Redistributions of source code must retain the above copyright notice, this list of conditions and the following 
 * disclaimer.                        
 * 
 * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following 
 * disclaimer in the documentation and/or other materials provided with the distribution.                       
 * 
 * Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote 
 * products derived from this software without specific prior written permission.                                           
 *                                                                              
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, 
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE  
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR  
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                                                  
 *                                                                              
 * To improve the quality of the software, users are encouraged to share modifications, enhancements or bug fixes with 
 * Infineon Technologies AG dave@infineon.com).                                                          
 *********************************************************************************************************************
 *
 * Change History
 * --------------
 *
 * 2015-02-20:
 *     - Initial draft<br>
 *     - Documentation improved <br>
 *
 * 2015-05-08:
 *     - Added XMC_USIC_CH_SetInputTriggerCombinationMode() and XMC_USIC_CH_SetTransmitBufferStatus()  <br>
 *      
 * 2015-06-20:
 *     - Removed version macros and declaration of GetDriverVersion API
 * 
 * 2015-08-17:
 *     - Bug fixed in XMC_USIC_CH_SetTransmitBufferStatus API. OR operator removed.
 *
 * 2015-08-24:
 *     - Added APIs for enabling/disabling delay compensation XMC_USIC_CH_DisableDelayCompensation() and
 *       XMC_USIC_CH_DisableDelayCompensation()
 *
 * 2015-08-25:
 *     - Added APIs for defining if the data shift unit input is derived
 *       from the input data path DXn or from the selected protocol pre-processors: XMC_USIC_CH_ConnectInputDataShiftToPPP()
 *       and XMC_USIC_CH_ConnectInputDataShiftToDataInput()
 *
 * 2015-08-27:
 *     - Fixed bug in XMC_USIC_CH_BRG_CLOCK_SOURCE_DX1T value.
 *     - Added APIs for direct TBUF access: XMC_USIC_CH_WriteToTBUF() and XMC_USIC_CH_WriteToTBUFTCI()
 *     - Added APIs for external input for BRG configuration:XMC_USIC_CH_ConfigExternalInputSignalToBRG() and XMC_USIC_CH_SetBRGInputClockSource()
 *
 * 2015-08-28:
 *     - Added API for enabling the transfer trigger unit to set bit TCSR.TE if the trigger signal DX2T becomes active. Feature used for RS-232
 *       Clear to Send (CTS) signal: XMC_USIC_CH_EnableTBUFDataValidTrigger() and XMC_USIC_CH_DisableTBUFDataValidTrigger().
 *
 * 2016-03-09:
 *     - Optimization of write only registers
 *
 * 2016-04-10:
 *     - Added an API to put the data into FIFO when hardware port control is enabled: XMC_USIC_CH_TXFIFO_PutDataHPCMode() <br>
 *
 * @endcond
 *
 */

#ifndef XMC_USIC_H
#define XMC_USIC_H
/*******************************************************************************
 * HEADER FILES
 *******************************************************************************/

#include "xmc_common.h"

/**
 * @addtogroup XMClib XMC Peripheral Library
 * @{
 */

/**
 * @addtogroup USIC
 * @brief Universal Serial Interface Channel(USIC) driver for serial communication.
 *
 * The Universal Serial Interface Channel(USIC) module is a flexible interface module
 * covering several serial communication protocols. A USIC module contains two
 * independent communication channels named USICx_CH0 and USICx_CH1, with x
 * being the number of the USIC module. The user can program, during run-time, which protocol will be handled
 * by each communication channel and which pins are used.
 * The driver provides APIs, configuration structures and enumerations to configure common features of multiple serial
 * communication protocols.
 * 
 * USIC driver features:
 * -# Allows configuration of FIFO for transmit and receive functions.
 * -# Provides a structure type XMC_USIC_CH_t to represent the USIC channel registers in a programmer
 friendly format.
 * -# Allows configuration of automatic update for frame length, word length, slave select or slave address.
 * -# Allows transmission of data to FIFO using XMC_USIC_CH_TXFIFO_PutData() and XMC_USIC_CH_TXFIFO_PutDataFLEMode()
 * -# Allows reading of received data in FIFO using XMC_USIC_CH_RXFIFO_GetData()
 * -# Allows configuration of baudrate using XMC_USIC_CH_SetBaudrate()
 * -# Provides API to trigger interrupts using XMC_USIC_CH_TriggerServiceRequest()
 * @{
 */

